import React from "react";
import buld from "../images/buld.jpg";
import "../styles/dar.css";
import Footer from "../components/Layout/Footer/Footer";
import mark from "../images/svg.png";
import { NavLink } from "react-router-dom";

const Darulifta = () => {
  // React.useEffect(() => {
  //     async function got() {
  //         const { data } = await axios.get(`${server}/questions/all`);
  //         console.log(data)
  //     }
  //     got()
  // }, []);
  return (
    <>
      <section className="sectionOfdar">
        <div className="headerofdar">
          <h1> دارالعلوم حقانیہ لورالائی</h1>
          <h3>دارالافتاء </h3>
        </div>
        <div className="underSection">
          <div className="darparaandimg">
            <div className="imgOfdar">
              <img className="imgOf-dar" src={buld} alt="img" />
            </div>
            <p className="paraOfdar">
              اُردُو[8] برصغیر کی معیاری زبانوں میں سے ایک ہے۔ یہ پاکستان کی
              قومی اور رابطہ عامہ کی زبان ہے، جبکہ بھارت کی چھ ریاستوں کی دفتری
              زبان کا درجہ رکھتی ہے۔ آئین ہند کے مطابق اسے 22 دفتری شناخت شدہ
              زبانوں میں شامل کیا جا چکا ہے۔ 2001ء کی مردم شماری کے مطابق اردو
              کو بطور مادری زبان بھارت میں 5.01% فیصد لوگ بولتے ہیں اور اس لحاظ
              سے ہی بھارت کی چھٹی بڑی زبان ہے جبکہ پاکستان میں اسے بطور مادری
              زبان 7.59% فیصد لوگ استعمال کرتے ہیں، یہ پاکستان کی پانچویں بڑی
              زبان ہے۔ اردو تاریخی طور پر ہندوستان کی مسلم آبادی سے جڑی ہے۔[9]
              زبانِ اردو کو پہچان و ترقی اس وقت ملی جب برطانوی دور میں انگریز
              حکمرانوں نے اسے فارسی کی بجائے انگریزی کے ساتھ شمالی ہندوستان کے
              علاقوں اور جموں و کشمیر میں اسے 1846ء اور پنجاب میں 1849ء میں بطور
              دفتری زبان نافذ کیا۔ اس کے علاوہ خلیجی، یورپی، ایشیائی اور امریکی
              علاقوں میں اردو بولنے والوں کی ایک بڑی تعداد آباد ہے جو بنیادی طور
              پر جنوبی ایشیاء سے کوچ کرنے والے اہلِ اردو ہیں۔ 1999ء کے اعداد و
              شمار کے مطابق اردو زبان کے مجموعی متکلمین کی تعداد دس کروڑ ساٹھ
              لاکھ کے لگ بھگ تھی۔ اس لحاظ سے یہ دنیا کی نویں بڑی زبان ہے۔ اردو
              زبان کو کئی ہندوستانی ریاستوں میں سرکاری حیثیت بھی حاصل ہے۔ [10]
              نیپال میں، اردو ایک رجسٹرڈ علاقائی بولی ہے [11] اور جنوبی افریقہ
              میں یہ آئین میں ایک محفوظ زبان ہے۔ یہ افغانستان اور بنگلہ دیش میں
              اقلیتی زبان کے طور پر بھی بولی جاتی ہے، جس کی کوئی سرکاری حیثیت
              نہیں ہے۔ 1837ء میں، اردو برطانوی ایسٹ انڈیا کمپنی کی سرکاری زبان
              بن گئی، کمپنی کے دور میں پورے شمالی ہندوستان میں فارسی کی جگہ لی
              گئی۔ فارسی اس وقت تک مختلف ہند-اسلامی سلطنتوں کی درباری زبان کے
              طور پر کام کرتی تھی۔ [12] یورپی نوآبادیاتی دور میں مذہبی، سماجی
              اور سیاسی عوامل پیدا ہوئے جنہوں نے اردو اور ہندی کے درمیان فرق
              کیا، جس کی وجہ سے ہندی-اردو تنازعہ شروع ہوا ۔ اردو 18ویں صدی میں
              ایک ادبی زبان بن گئی اور اسی طرح کی دو معیاری شکلیں دہلی اور لکھنؤ
              میں وجود میں آئیں۔ 1947ء میں تقسیم ہند کے بعد سے پاکستانی شہر
              کراچی میں ایک تیسرا معیار پیدا ہوا ہے۔ [13] [14] دکنی ، ایک پرانی
              شکل جو دکن میں استعمال ہوتی تھی، سولہویں صدی تک دکن سلاطین کی
              درباری زبان بن گئی۔ [15] [14] اُردو کا بعض اوقات ہندی کے ساتھ
              موازنہ کیا جاتا ہے۔ اُردو اور ہندی میں بُنیادی فرق یہ ہے کہ اُردو
              نستعلیق رسم الخط میں لکھی جاتی ہے اور عربی و فارسی الفاظ استعمال
              کرتی ہے۔ جبکہ ہندی زبان دیوناگری رسم الخط میں لکھی جاتی ہے اور
              سنسکرت الفاظ زیادہ استعمال کرتی ہے۔ کچھ ماہرینِ لسانیات اُردو اور
              ہندی کو ایک ہی زبان کی دو معیاری صورتیں گردانتے ہیں۔ لیکن حقیقت یہ
              ہے کہ ہندی، اُردو زبان سے نکلی ہے۔ اسی طرح اگر اردو اور ہندی زبان
              کو ایک سمجھا جائے تو یہ دنیا کی چوتھی بڑی زبان ہے۔ اردو زبان دنیا
              کی نئی زبانوں میں سے ہونے کے باوجود اپنے پاس معیاری اور وسیع ذخیرہ
              ادب رکھتی ہے۔ خاص کر جنوبی ایشیائی زبانوں میں اردو اپنی شاعری کے
              حوالے سے جانی جاتی ہے۔
            </p>
          </div>
          <div className="sawalat_dar">
            <h4>سوالات</h4>
            <ul>
              <li>
                <img className="svg" src={mark} alt="img"/>
                پاکستانی شہر کراچی میں ایک تیسرا معیار پیدا ہوا ہے
              </li>
              <li>
                <img className="svg" src={mark} alt="img"/>
                پاکستانی شہر کراچی میں ایک تیسرا معیار پیدا ہوا ہے
              </li>
              <li>
                <img className="svg" src={mark} alt="img"/>
                پاکستانی شہر کراچی میں ایک تیسرا معیار پیدا ہوا ہے
              </li>
              <li>
                <img className="svg" src={mark} alt="img"/>
                پاکستانی شہر کراچی میں ایک تیسرا معیار پیدا ہوا ہے
              </li>
            </ul>
          </div>
        </div>
      </section>
      <section className="sectionOfdar2">
        <NavLink to="/ask" className="div1">
          سوال بھیجیں
        </NavLink>
        <div className="div2">
          معزز قارئین اپنے سوالات بھیجنے کیلئے بٹن پر کلک کریں اور جواب کا
          انتظار کریں جواب آپ کو بھیج دی جائیگی
        </div>
        <NavLink to="/ask" className="div3">
          سوال بھیجیں
        </NavLink>
      </section>
      <Footer />
    </>
  );
};

export default Darulifta;
